Crie um DataFrame com pelo menos 5 estudantes, onde algumas notas estejam ausentes (use np.nan para representar os valores nulos).

Aplique o método isnull() para verificar quantas notas estão faltando.

Preencha as notas ausentes com a média das notas dos estudantes que têm notas preenchidas.

Converta a coluna "idade" para o tipo inteiro, caso esteja como float.

Exiba o DataFrame final para verificar se as notas foram preenchidas corretamente e se a coluna "idade" está no formato correto.

In [12]:
import pandas as pd
import numpy as np

In [13]:
df_estudantes = pd.DataFrame({
    'Nome': ['Ana', 'Maria', 'Pedro', 'João', 'Lucas'],
    'Nota': [8.5, np.nan, 7.5, 8.0, np.nan],
    'Idade': [23, 30, 21, 25, 28]
})

df_estudantes

    Nome  Nota  Idade
0    Ana   8.5     23
1  Maria   NaN     30
2  Pedro   7.5     21
3   João   8.0     25
4  Lucas   NaN     28

In [14]:
df_estudantes.isnull().sum()

Nome     0
Nota     2
Idade    0
dtype: int64

In [15]:
df_estudantes['Nota_Preenchida'] = df_estudantes['Nota'].fillna(df_estudantes['Nota'].mean())

df_estudantes

    Nome  Nota  Idade  Nota_Preenchida
0    Ana   8.5     23              8.5
1  Maria   NaN     30              8.0
2  Pedro   7.5     21              7.5
3   João   8.0     25              8.0
4  Lucas   NaN     28              8.0

In [16]:
df_estudantes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Nome             5 non-null      object
 1   Nota             3 non-null      float64
 2   Idade            5 non-null      int64
 3   Nota_Preenchida  5 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 292.0+ bytes

In [21]:
df_estudantes['Idade'] = df_estudantes['Idade'].astype('int64')

In [22]:
display(df_estudantes)
df_estudantes.info()

    Nome  Nota  Idade  Nota_Preenchida
0    Ana   8.5     23              8.5
1  Maria   NaN     30              8.0
2  Pedro   7.5     21              7.5
3   João   8.0     25              8.0
4  Lucas   NaN     28              8.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Nome             5 non-null      object
 1   Nota             3 non-null      float64
 2   Idade            5 non-null      int64
 3   Nota_Preenchida  5 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 292.0+ bytes